tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          baffleRegion;

faceZones       (baffleFaces2);

oneD            false;

extrudeModel    linearNormal;

nLayers         10;

expansionRatio  1;

adaptMesh       yes; // apply directMapped to both regions

sampleMode      nearestPatchFace;

linearNormalCoeffs
{
    thickness       0.02;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
